; domain
(define (domain ferry)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l4-c10)
(:domain ferry)
(:objects l0 l1 l2 l3 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(car c6)
(car c7)
(car c8)
(car c9)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(empty-ferry)
(at c0 l2)
(at c1 l3)
(at c2 l0)
(at c3 l3)
(at c4 l1)
(at c5 l2)
(at c6 l0)
(at c7 l1)
(at c8 l1)
(at c9 l3)
(at-ferry l2)
)
(:goal
(and
(at c0 l2)
(at c1 l3)
(at c2 l1)
(at c3 l1)
(at c4 l1)
(at c5 l1)
(at c6 l2)
(at c7 l1)
(at c8 l3)
(at c9 l2)
)
)
)

; plan
1. (board c5 l2)
   deleted: (at c5 l2) (empty-ferry)
   added: (on c5)
   goals met: 4 of 10
2. (sail l2 l1)
   deleted: (at-ferry l2)
   added: (at-ferry l1)
   goals met: 4 of 10
3. (debark c5 l1)
   deleted: (on c5)
   added: (at c5 l1) (empty-ferry)
   goals met: 5 of 10
4. (board c8 l1)
   deleted: (at c8 l1) (empty-ferry)
   added: (on c8)
   goals met: 5 of 10
5. (sail l1 l3)
   deleted: (at-ferry l1)
   added: (at-ferry l3)
   goals met: 5 of 10
6. (debark c8 l3)
   deleted: (on c8)
   added: (at c8 l3) (empty-ferry)
   goals met: 6 of 10
7. (board c3 l3)
   deleted: (at c3 l3) (empty-ferry)
   added: (on c3)
   goals met: 6 of 10
8. (sail l3 l1)
   deleted: (at-ferry l3)
   added: (at-ferry l1)
   goals met: 6 of 10
9. (debark c3 l1)
   deleted: (on c3)
   added: (at c3 l1) (empty-ferry)
   goals met: 7 of 10
10. (sail l1 l0)
   deleted: (at-ferry l1)
   added: (at-ferry l0)
   goals met: 7 of 10
11. (board c2 l0)
   deleted: (at c2 l0) (empty-ferry)
   added: (on c2)
   goals met: 7 of 10
12. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 7 of 10
13. (debark c2 l1)
   deleted: (on c2)
   added: (at c2 l1) (empty-ferry)
   goals met: 8 of 10
14. (sail l1 l0)
   deleted: (at-ferry l1)
   added: (at-ferry l0)
   goals met: 8 of 10
15. (board c6 l0)
   deleted: (at c6 l0) (empty-ferry)
   added: (on c6)
   goals met: 8 of 10
16. (sail l0 l2)
   deleted: (at-ferry l0)
   added: (at-ferry l2)
   goals met: 8 of 10
17. (debark c6 l2)
   deleted: (on c6)
   added: (at c6 l2) (empty-ferry)
   goals met: 9 of 10
18. (sail l2 l3)
   deleted: (at-ferry l2)
   added: (at-ferry l3)
   goals met: 9 of 10
19. (board c9 l3)
   deleted: (at c9 l3) (empty-ferry)
   added: (on c9)
   goals met: 9 of 10
20. (sail l3 l2)
   deleted: (at-ferry l3)
   added: (at-ferry l2)
   goals met: 9 of 10
21. (debark c9 l2)
   deleted: (on c9)
   added: (at c9 l2) (empty-ferry)
   goals met: 10 of 10
